<template>
  <h3>Создание группы "Семья"</h3>
    
  <p>Вы можете создать "Семью", чтобы отслеживать траты своих родственников</p>
  <p>Следите куда тратит деньги вам ребенок, планируйте покупки, и просто расчитывайте свой доход</p>
    
  <BButton type="submit" class="btn btn-primary">Создать</BButton>
</template>

<script lang="ts">
//  TODO
// структура для компонентов примерно такая
// CreateFamily
//    CreateFamily.vue
//    CreateFamily.scss // иногда выносят стили в отдельный файл
//    CreateFamily.test.vue // для тестов
// показал примеры со стилями и тестами, чтобы показать почему нужна отдельная папка под компонент
</script>